// -*- mode: java -*- Time-stamp: <2009-06-26 19:54:27 kahata>
/*====================================================================
 * name: j232.java 
 * created : Time-stamp: <09/06/26(金) 19:54:04 hata>
 * $Id$
 * Programmed by kahata
 * To compile:
 * To run:
 * links: http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/java.shtml
 *   http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/CLASS/j232.htm
 * description: Java プログラミング(基礎と応用)  仙波一郎
 * ====================================================================*/
////////////////////////////////////////////////////////////////////////////////
//  << j232.java >>
//
//　クラス（３）：引数（値渡しと参照渡し）
//
//　●値渡し
//
//　　メソッドの引数が基本型(論理型、文字型、整数型、浮動小数点型)の変数の場合、
//　　「値渡し」が行われ、実引数の変数の値が仮引数の変数にコピーされる。
//    この結果、メソッド内で仮引数に変更がなされても、実引数にその影響は及ばない。
//
//　●参照渡し
//
//　　メソッドの引数が参照型の変数の場合、「参照渡し」が行われ、実引数の変数が
//　　指すオブジェクトの位置の値(アドレス)が仮引数の変数にコピーされる。
//　　この結果、メソッド内で仮引数に変更がなされると、実引数にその影響が及ぶ。
//　　配列も参照型の変数なので、参照渡しが行われる。
//
////////////////////////////////////////////////////////////////////////////////
