// -*- mode: java -*- Time-stamp: <2009-06-27 10:44:55 kahata>
/*====================================================================
 * name: j235.java 
 * created : Time-stamp: <09/06/27(土) 10:44:25 hata>
 * $Id$
 * Programmed by kahata
 * To compile:
 * To run:
 * links: http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/java.shtml
 *   http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/CLASS/j235.htm
 * description: Java プログラミング(基礎と応用)  仙波一郎
 * ====================================================================*/
////////////////////////////////////////////////////////////////////////////////
//  << j235.java >>
//
//  クラス（３）：コンストラクタ
//
//　　オブジェクトを作成するときに、自動的に呼び出され実行される特別な
//　　メソッドをコンストラクタという。
//
//  ●コンストラクタ
//
//　　・クラス内にコンストラクタが定義されている場合、オブジェクトの作成時に
//　　　コンストラクタが実行される。
//　　・クラス内にコンストラクタが定義されていない場合、オブジェクトの作成時に
//　　　引数のないコンストラクタ（デフォルトコンストラクタという）が用意され
//　　　自動的に実行される。
//      デフォルトコンストラクタは、フィールドの記憶領域を確保するだけである。
//　　・オブジェクトの初期化などに使われる。
//
//　●コンストラクタの書き方
//
//　　class クラス名 {
//        ・・・
//　　　クラス名(引数) { // コンストラクタ
//         コンストラクタ内の処理
//　　　}
//      ・・・
//    }
//
//　　・コンストラクタは、クラス名と同じ名前のメソッドとして定義される。
//　　・コンストラクタは戻り値の型をもたない。
//
////////////////////////////////////////////////////////////////////////////////
