// -*- mode: java -*- Time-stamp: <2009-06-29 20:20:19 kahata>
/*====================================================================
 * name: j291.java 
 * created : Time-stamp: <09/06/29(月) 20:20:01 hata>
 * $Id$
 * Programmed by kahata
 * To compile:
 * To run:
 * links: http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/java.shtml
 *   http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/CLASS/j291.htm
 * description: Java プログラミング(基礎と応用)  仙波一郎
 * ====================================================================*/
////////////////////////////////////////////////////////////////////////////////
//  << j291.java >>
//
//　●クラスライブラリ
//
//　　クラスを集めたものをクラスライブラリと呼び、機能別にパッケージに分類されて
//　　いる。よく使われるクラスライブラリを標準クラスライブラリという。
//　　Javaプログラムを書くときに、クラスライブラリを調べ、クラスの機能を確認する
//　　ことになる。このために、リファレンスが準備されている。
//
//　　　パッケージ名　　　機能
//　　　java.lang　　　　　Javaの基本的なクラスが集められている。
//　　　java.applet　　　　アプレットに関するクラスが集められている。
//　　　java.io　　　　　　入出力に関するクラスが集められている。
//　　　java.awt 　　　　　AWTに関するクラスが集められている。
//
//　●クラスライブラリ・リファレンスの取得
//　　
//　（１）リファレンスをダウンロードする。
//　　　(a)Webページ：http://java.sun.com/j2se/1.5.0/ja/download.html に
//　　　   Webブラウザでアクセスする。
//　　 　　J2SE 5.0ドキュメントのdownloadボタンをクリックする。    
//　　　(b)Webページが切り替わる。LICENSE AGREEMENTのACCEPT項目をクリックし、
//　　　　　　Continueボタンをクリックする。
//　　　(c)J2SE(TM) Development Kit Documentation 5.0 Japanese をクリックする。 
//         ダウンロードが始まるので、デスクトップに保存する。
//　　　　 ダウンロードが終了すると、ファイル(jdk-1_5_0_-doc-ja.zip)を示す
//　　　 　アイコンが表示される。
//
//　（２）ファイル(jdk-1_5_0-doc-ja.zip)を右クリックし「すべて展開」項目を
//　　　　クリックする。
//　　　　展開先のディレクトリは、c:\jdk-1_5_0-doc-jaとする。
//
//　●リファレンスの表示
//
//　　ファイル(c:\jdk-1_5_0-doc-ja\docs\ja\api\index.html)をWebブラウザで開く。
//
////////////////////////////////////////////////////////////////////////////////
