// -*- mode: java -*- Time-stamp: <2009-06-26 17:20:57 kahata>
/*====================================================================
 * name: j233.java 
 * created : Time-stamp: <09/06/26(金) 17:20:36 hata>
 * $Id$
 * Programmed by kahata
 * To compile:
 * To run:
 * links: http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/java.shtml
 *   http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/CLASS/j233.htm
 * description: Java プログラミング(基礎と応用)  仙波一郎
 * ====================================================================*/
////////////////////////////////////////////////////////////////////////////////
//  << j233.java >>
//
//　クラス（３）：可変引数
//
//　　可変個の引数を指定できる。
//　　
//    ○指定法
//
//　　　・可変引数のみの場合
//
//　　　　　メソッド名(型名... 変数名)
//
//　　　・可変引数と固定引数の場合（可変引数は、引数の並びの最後に書く）
//
//　　　　　メソッド名(固定引数, 型名... 変数名)
//
//　　○メソッド内では、配列で受け取ったと同様に処理する。
//
//　　　・引数の個数　変数名.length
//　　　・引数　　　　変数名[添字]
//
////////////////////////////////////////////////////////////////////////////////
