// -*- mode: java -*- Time-stamp: <2009-06-27 10:24:22 kahata>
/*====================================================================
 * name: j234.java 
 * created : Time-stamp: <09/06/27(土) 10:24:00 hata>
 * $Id$
 * Programmed by kahata
 * To compile:
 * To run:
 * links: http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/java.shtml
 *   http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/CLASS/j234.htm
 * description: Java プログラミング(基礎と応用)  仙波一郎
 * ====================================================================*/
////////////////////////////////////////////////////////////////////////////////
//  << j234.java >>
//
//  クラス（３）：オーバーロード
//
//  ●オーバーロード
//
//　　・オーバーロードとは、類似した機能をもつ複数のメソッドに同じ名前を
//　　　付けることをいう。多重定義ともいう。
//
//    ・メソッドは、引数リストが異なっていれば、同じ名前で定義できる。
//　  　メソッドが呼び出されるときは、引数リストの違いで区別される。
//　　　引数リストが同じとは、引数の個数、データの型、並びの順序が同じである
//　　　ことである。
//　　　メソッド名と引数リストをあわせて、シグニチャという。
//
//　  ・オーバーロードを使うと、プログラムが分かりやすくなる効果がある。
//
////////////////////////////////////////////////////////////////////////////////
