// -*- mode: java -*- Time-stamp: <09/05/19 16:28:13 kazuhiko>
/*====================================================================
 * name: j222.java 
 * created : Time-stamp: <09/06/25(木) 19:38:35 hata>
 * $Id$
 * Programmed by kahata
 * To compile:
 * To run:
 * links: http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/java.shtml
 *   http://jubilo.cis.ibaraki.ac.jp/~isemba/PROGRAM/JAVA/CLASS/j222.htm
 * description: Java プログラミング(基礎と応用)  仙波一郎
 * ====================================================================*/
////////////////////////////////////////////////////////////////////////////////
//  << j222.java >>
//
//  クラス（２）：スコープ
//
//　●スコープ
//
//  　変数の利用できる有効範囲をスコープという。
//　　クラス内、メソッド内、ブロック({と}で囲まれた部分）内でスコープが
//　　定義されている。
//
//　　・クラスのスコープ
//　　　クラス内で宣言されたフィールド変数はクラス内のみで有効である。
//
//　　・メソッドのスコープ
//　　　メソッド内で宣言されたローカル変数はメソッド内のみで有効である。
//
//　　・ブロックのスコープ
//　　　ブロック内で宣言されたローカル変数はブロック内のみで有効である。
//　　　ブロック外では、その領域が破棄され、アクセスできない。
//
////////////////////////////////////////////////////////////////////////////////
